Show / Hide Table of Contents
Class ConProjectInfo
Provides informationabout
Inheritance
System.Object
ConProjectInfo
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[DataContract]
public class ConProjectInfo
Properties
Improve this Doc   View Source
Author
Name of the author
Declaration
[DataMember]
public string Author { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Connections
Connections in the project
Declaration
[DataMember]
public List<ConnectionInfo> Connections { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ConnectionInfo>
Improve this Doc   View Source
Date
Date
Declaration
[DataMember]
public DateTime Date { get; set; }
Property Value
 Type |  Description
 System.DateTime
Improve this Doc   View Source
Description
The description of the project
Declaration
[DataMember]
public string Description { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
DesignCode
Design code
Declaration
[DataMember]
public string DesignCode { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Name
The name of the project
Declaration
[DataMember]
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
ProjectNumber
Project number
Declaration
[DataMember]
public string ProjectNumber { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source